Repository: villearo/offer-generator
Catalog: languages/offer-generator-*.po
Languages: fi

source: Offer Generator Settings
fi: Tarjousgeneraattorin asetukset

source: Offer Generator
fi: Tarjousgeneraattori

source: Offers
fi: Tarjoukset

source: Offer
fi: Tarjous

source: All Offers
fi: Kaikki Tarjoukset

source: Add New Offer
fi: Lisää uusi tarjous

source: Edit Offer
fi: Muokkaa tarjousta

source: View Offer
fi: Näytä tarjous

source: offers
fi: tarjoukset

source: Services
fi: Palvelut

source: Service
fi: Palvelu

source: All Services
fi: Kaikki palvelut

source: Add New Service
fi: Lisää uusi palvelu

source: Edit Service
fi: Muokkaa palvelua

source: View Service
fi: Näytä palvelu

source: Non-recurring charges:
fi: Kertaluonteiset maksut:

source: Non-recurring charges total:
fi: Kertaluonteiset maksut yhteensä:

source: Recurring charges:
fi: Kuukausikohtaiset maksut:

source: Recurring charges total:
fi: Kuukausikohtaiset maksut yhteensä:

source: Delivery method:
fi: Toimitustapa:

source: Payment terms:
fi: Maksuehto:

source: Offer valid until:
fi: Tarjous voimassa:

source: Other terms:
fi: Sopimusehdot:

source: Contact person:
fi: Yhteyshenkilö:

source: Service descriptions
fi: Palvelukuvaukset

source: Print Offer
fi: Tulosta tarjous

source: Accept Offer
fi: Hyväksy tarjous

source: Offer Details
fi: Tarjouksen lisätiedot

source: Service Details
fi: Palvelun lisätiedot

source: Offer Title
fi: Tarjouksen otsikko

source: Service Price
fi: Palvelun hinta

source: Recurring service
fi: Toistuva palvelu
